Repository: clairvy/perl6-doc-ja
Catalog: perl6-doc-ja-level2.tmx
Source language: en_us
Languages: ja

source: If for a particular MMD dispatch, nothing in the MMD system claims it, it dispatches to as an Any with an undefined value, and usually blows up constructively.
ja: もし特定のMMDディスパッチに対してMMDシステムが何も主張しないなら、それは未定義値を伴うAnyにディスパッチされ、そして普通は前向きに怒ります。

source: you should probably not expect it to yield a reasonable answer, unless you think an exception is reasonable.
ja: あなたが例外を合理的だと思わないなら、合理的な答えを生じさせると期待しないべきかもしれません。

source: Since the Whatever object is effectively immutable, the optimizer is free to recognize * and optimize in the context of what operator it is being passed to.
ja: Whateverオブジェクトは事実上は不変なので、オプティマイザは*を自由に認識することができ、どの演算子に渡されるのかコンテキストの中で最適化します。

source: Most of the built-in numeric operators treat an argument of * as indicating the desire to create a function of a single unknown, so:
ja: ほとんどのビルトイン数値演算子は引数の*を単独の未知の関数を作成することを満たすとして扱います。つまり:

source: produces a function of a single argument:
ja: は単独の引数の関数を生成します:

source: Likewise, the single dispatcher recognizes *.meth and returns { $_.meth }, so it can be used where patterns are expected:
ja: 同様に単独のディスパッチャーは*.methを認識して{ $_.meth }を返すので、そのパターンが期待される場所で使用することが出来ます:

source: These closures are of type Code:($), not Whatever, so that constructs can distinguish via multiple dispatch:
ja: これらのクロージャーはWhateverではなくCode:($)型なので、その構造はマルチディスパッチによって区別できます:

source: The bare * form may also be called as a function, and represents the identify function:
ja: 裸の*形式は関数としても呼ぶことができ、関数の識別を表します:

source: But note that this is not what is happening above, or
ja: しかし注意として、これは上で起こっていることではありません。または

source: would end up meaning:
ja: は以下を意味することになります:

source: The ... operator is instead dispatching bare * to a routine that does dwimmery, and in this case decides to supply a function { * + 1 }.
ja: ...演算子は代わりに*を期待通りに動作するルーチンにディスパッチしています。そしてこの場合は関数 { * + 1 } を供給すると決定します。

source: The final element of an array is subscripted as @a[*-1], which means that when the subscripting operation discovers a Code object for a subscript, it calls it and supplies an argument indicating the number of elements in (that dimension of) the array.
ja: 配列の最後の要素は@a[*-1]として添字化され、それは添字操作がCodeオブジェクトを添字に見つけると、それを呼んで(その次元の)配列内の要素数を示す引数を供給することを意味します。

source: See S09.
ja: S09を参照して下さい。

source: A variant of * is the ** term, which is of type HyperWhatever.
ja: *の変化形は**という項で、それはHyperWhatever型です。

source: It is generally understood to be a multidimension form of * when that makes sense.
ja: それは一般的に、意味をなす場合は多次元形式の*と理解されます。

source: When modified by an operator that would turn * into a function of one argument, ** instead turns into a function with a slurpy argument, of type Code:(*@).
ja: 演算子によって*が1つの引数の関数に変換される場合、 **は代わりにすばらしい引数を伴う関数、Code:(*@)型に変化します。

source: Therefore @array[^**] represents @array[{ map { ^* }, @_ }], that is to say, every element of the array, no matter how many dimensions.
ja: 従って@array[^**]は@array[{ map { ^* }, @_ }]を表し、配列の次元数を問わない配列の全要素ということになります。

source: (However, @array[**] means the same thing because (as with ... above), the subscript operator will interpret bare ** as meaning all the subscripts, not the list of dimension sizes.
ja: (ただし@array[**]は同じことを意味します。なぜなら (...で述べたように)添字演算子は裸の**を全ての添字と解釈し、次元のサイズのリストとは解釈しないからです。

source: The meaning of Whatever is always controlled by its immediate context.)
ja: Whateverの意味は常にその場のコンテキストによってコントロールされます。)

source: Other uses for * and ** will doubtless suggest themselves over time.
ja: *と**の他の用途はそのうちにそれら自身で示されるでしょう。

source: These can be given meaning via the MMD system, if not the compiler.
ja: コンパイラがそうでなければ、これらはMMDシステムによって意味を与えられることができます。

source: Values with these types autobox to their uppercase counterparts when you treat them as objects:
ja: これらの型の値は、それらの対になる大文字の型のオブジェクトとして扱われる時はautobox化されます:

source: Since native types cannot represent Perl's concept of undefined values, in the absence of explicit initialization, native floating-point types default to NaN, while integer types (including bit) default to 0.
ja: ネイティブ型はPerlの概念の未定義値を表現できないので、明確な初期化がなければネイティブ浮動小数点はデフォルトでNaN、整数（bit含む)はデフォルトで0になります。

source: The complex type defaults to NaN + NaN\i.
ja: complex型のデフォルトはNaN + NaN\iです。

source: A buf type of known size defaults to a sequence of 0 values.
ja: 既知のサイズのbuf型は0の値のシーケンスがデフォルトになります。

source: If any native type is explicitly initialized to * (the Whatever type), no initialization is attempted and you'll get whatever was already there when the memory was allocated.
ja: もしネイティブ型が*(Whatever型)に明示的に初期化されたら、メモリに既に割り当てられた値が割り当てられます。

source: If a buf type is initialized with a Unicode string value, the string is decomposed into Unicode codepoints, and each codepoint shoved into an integer element.
ja: もしbuf型がユニコード文字列の値で初期化されたら、文字列はユニコードのコードポイントに分解され、それぞれのコードポイントは整数の要素に押し込まれます。

source: If the size of the buf type is not specified, it takes its length from the initializing string.
ja: buf型のサイズが指定されない場合は、初期化する文字列の長さから持ってきます。

source: If the size is specified, the initializing string is truncated or 0-padded as necessary.
ja: サイズが指定された場合は文字列は必要に応じて切り詰められるか0で埋められます。

source: If a codepoint doesn't fit into a buf's integer type, a parse error is issued if this can be detected at compile time; otherwise a warning is issued at run time and the overflowed buffer element is filled with an appropriate replacement character, either U+FFFD (REPLACEMENT CHARACTER) if the element's integer type is at least 16 bits, or U+007f (DELETE) if the larger value would not fit.
ja: もしコードポイントがbufの整数型にフィットしない場合は、コンパイル時に検出できるならパースエラーが発生します。そうでなければ実行時に警告され、オーバーフローしたバッファの要素は適切な代替文字U+FFFD (置き換え文字、整数型が少なくとも16ビットの場合)かU+007f (削除文字、より大きい値にフィットしない場合)に置き換えられます。

source: If any other conversion is desired, it must be specified explicitly.
ja: 他の変換を望む場合は、明示的に指定する必要があります。

source: In particular, no conversion to UTF-8 or UTF-16 is attempted; that must be specified explicitly.
ja: 特にUTF-8かUTF-16への変換は試みられません。明示的に指定する必要があります。

source: (As it happens, conversion to a buf type based on 32-bit integers produces valid UTF-32 in the native endianness.)
ja: (それが起こったら、32ビット整数ベースのbufへの変換はネイティブエンディアンの有効なUTF-32を生成します。)

source: These can behave as values or objects of any class, except that defined always returns false.
ja: definedが常にfalseを返す場合を除き、未定義型は値または何かのクラスのオブジェクトとして振る舞うことができます。

source: One can create them with the built-in undef and fail functions.
ja: それは組み込みのundefかfail関数で作成できます。

source: (See S04 for how failures are handled.)
ja: (failuresがどの様に処理されるかはS04を参照して下さい。)

source: Whenever you declare any kind of type, class, module, or package, you're automatically declaring a undefined prototype value with the same name.
ja: どの種類のtype、class、moduleまたはpackageを定義した場合でも、自動的に同じ名前の未定義プロトタイプ値を定義します。

source: Whenever a Failure value is put into a typed container, it takes on the type specified by the container but continues to carry the Failure role.
ja: Failure値が型付けされたコンテナに設置された時はいつでもコンテナによって指定された型を引き受けますが、Failureのroleをもたらし続けます。

source: (The undef function merely returns the most generic Failure object.
ja: (undef関数は最も一般的なFailureオブジェクトを返します。

source: Use fail to return more specific failures.
ja: より特定のfailuresを返すにはfailを使って下さい。

source: Use Object for the most generic non-failure undefined value.
ja: 最も一般的なnon-failureの未定義値にはObjectを使って下さい。

source: The Any type is also undefined, but excludes junctions so that autothreading may be dispatched using normal multiple dispatch rules.)
ja: Any型も未定義ですが、autothreadingは普通のマルチディスパッチの規則でディスパッチされるのでjunctionsは除外します。)

source: The Nil type is officially undefined as an item but interpolates as a null list into list context, and an empty capture into slice context.
ja: Nil型は項目として公式に未定義ですが、リストコンテキストではnullリストに、スライスコンテキストでは空キャプチャに補間されます。

source: A Nil object may also carry failure information, but if so, the object behaves as a failure only in item context.
ja: Nilオブジェクトはfailureの情報ももたらしますが、もしそうなら、オブジェクトはitemコンテキストでのみfailureとして振る舞います。

source: Use Failure/undef when you want to return a hard failure that will not evaporate in list context.
ja: リストコンテキストで消滅しないhard failureを返したい時は Failure/undefを使って下さい。

source: Objects with these types behave like values, i.e. $x === $y is true if and only if their types and contents are identical (that is, if $x.WHICH eqv $y.WHICH).
ja: これらの型は値のように振る舞います。すなわち、$x === $yはそれらの型と内容が同一の場合のみtrueです。(つまり$x.WHICH eqv $y.WHICHなら)

source: Insofar as Lists are lazy, they're really only partially immutable, in the sense that the past is fixed but the future is not.
ja: Listsがlazyである限りにおいて、過去が固定され、未来がないという意味では、それらは本当に部分的にだけ不変です。

source: The portion of a List yet to be determined by iterators may depend on mutable values.
ja: まだイテレータによって決定されていないListの部分は変更可能な値に依存します。

source: When an iterator is called upon to iterate and extend the known part of the list, some number of immutable values (which includes immutable references to mutable objects) are decided and locked in at that point.
ja: イテレータがリストの既知の部分の反復と拡張の上で呼ばれた時、いくつかの数の不変の値(変更可能なオブジェクトへの不変なリファレンスを含む)が決定され、その点でロックされます。

source: Iterators may have several different ways of iterating depending on the degree of laziness/eagerness desired in context.
ja: コンテキストで望まれるlaziness/eagernessの度合いに応じてイテレータはいくつかの異なる方法を持ちます。

source: The iterator API is described in S07.
ja: イテレータのAPIはS07で説明されています。

source: Instants and Durations are measured in atomic seconds with fractions.
ja: InstantとDurationは有理数で微少時間に測定されます。

source: Notionally they are real numbers which may be implemented in either Num or Rat types.
ja: 理論上、それらはNumかRat型で実装される実数です。

source: (Fixed-point implementations are strongly discouraged.) Interfaces that take Duration arguments, such as sleep(), may also take Num arguments, but Instant arguments must be explicitly created via any of various culturally aware time specification APIs that, by and large, are outside the CORE of Perl 6, with the possible exception of a constructor taking a native TAI value.
ja: (固定小数点の実装は強く推奨されません。)sleep()のようなDurationの引数を受け取るインターフェースはNum引数も受け取りますが、Instant引数はさまざまな文化を理解した時間仕様のAPI(概してPerl 6のCOREの外側で、ネイティブTAI値を受け取るコンストラクタの可能な例外を伴う)によって明示的に作成されたものでなければなりません。

source: In numeric context a Duration happily returns a Num representing seconds.
ja: 数値コンテキストではDurationは喜んで秒を表すNumを返します。

source: If pressed for a number, an Instant will return the length of time in atomic seconds from the TAI epoch, but it will be unhappy about it.
ja: 数値が求められる場面ではInstantはTAIエポック値の微少時間の長さを返すでしょう。しかしそれに関しては適切ではありません。

source: Systems which cannot provide a steady time base, such as POSIX systems, will simply have to make their best guess as to the correct atomic time.
ja: POSIXのような安定したタイムベースを返すことができないシステムでは、正しい微少時間を最大限に推測できるようにする必要があります。

source: Objects with these types have distinct .WHICH values that do not change even if the object's contents change.
ja: これらの型のオブジェクトはそれぞれがオブジェクトの内容が変わっても変わらない.WHICH値を持ちます。

source: (Routines are considered mutable because they can be wrapped in place.)
ja: (Routinesは変更可能と見なされます。なぜならそれらは適所にラップされることができるからです。)

source: A KeyHash differs from a normal Hash in how it handles default values.
ja: KeyHashは通常のHashとデフォルト値の扱いが異なります。

source: If the value of a KeyHash element is set to the default value for the KeyHash, the element is deleted.
ja: KeyHashの要素の値がKeyHashのデフォルト値にセットされていた場合、その要素は削除されます。

source: If undeclared, the default default for a KeyHash is 0 for numeric types, False for boolean types, and the null string for string and buffer types.
ja: 宣言されていない場合、KeyHashのデフォルトのデフォルトは数値型では0、ブール型ではFalse、文字列とバッファ型ではnull文字列です。

source: A KeyHash of a Object type defaults to the undefined prototype for that type.
ja: Object型のKeyHashはその型の未定義プロトタイプがデフォルトになります。

source: More generally, the default default is whatever defined value an undef would convert to for that value type.
ja: より一般的には、デフォルトのデフォルトは定義された値のなんでもの型に変換されるであろうundefです。

source: A KeyHash of Scalar deletes elements that go to either 0 or the null string.
ja: ScalarのKeyHashは0かnull文字列の要素を削除します。

source: A KeyHash also autodeletes keys for normal undef values (that is, those undefined values that do not contain an unthrown exception).
ja: KeyHashは通常のundef値のキーも削除します(つまりそれらの未定義値はスローされない例外を含みません)。

source: A KeySet is a KeyHash of booleans with a default of False.
ja: KeySetはFalseをデフォルトにしたブール値のKeyHashです。

source: If you use the Hash interface and increment an element of a KeySet its value becomes true (creating the element if it doesn't exist already).
ja: もしHashインターフェースを使い、KeySetの要素を増やした場合はその値はtrueになります(要素が存在しない場合は作成する)。

source: If you decrement the element it becomes false and is automatically deleted.
ja: もし要素を減らした場合はその要素はfalseになり、自動的に削除されます。

source: Decrementing a non-existing value results in a False value.
ja: 存在しない値を減らすとFalse値を生じます。

source: Incrementing an existing value results in True.
ja: 存在する値を増やすとTrueを生じます。

source: When not used as a Hash (that is, when used as an Array or list or Set object) a KeySet behaves as a Set of its keys.
ja: もしHashとして使わない場合(つまりArrayかリストかSetオブジェクトとして使った場合)KeySetはそのキーのSetとして振る舞います。

source: (Since the only possible value of a KeySet is the True value, it need not be represented in the actual implementation with any bits at all.)
ja: (KeySetの可能な値がTrue値だけなので、少しのことでも実際の実装では表現する必要はありません。)

source: A KeyBag is a KeyHash of UInt with default of 0.
ja: KeyBagは0をデフォルトにしたUIntのKeyHashです。

source: If you use the Hash interface and increment an element of a KeyBag its value is increased by one (creating the element if it doesn't exist already).
ja: もしあなたがHashインターフェースを使い、KeyBagの要素をインクリメントするとその値が1増加します(存在しない要素は作成されます)。

source: If you decrement the element the value is decreased by one; if the value goes to 0 the element is automatically deleted.
ja: 要素をデクリメントすると値が1減少します。値が0になると要素が自動的に削除されます。

source: An attempt to decrement a non-existing value results in a Failure value.
ja: 存在しない値をデクリメントしようとするとFailure値を生じます。

source: When not used as a Hash (that is, when used as an Array or list or Bag object) a KeyBag behaves as a Bag of its keys, with each key replicated the number of times specified by its corresponding value.
ja: Hashとして使われない場合(つまりArrayかリスト化Bagオブジェクトとして使われた場合)、KeyBagはそのキーのBagとして振る舞い、それぞれのキーは対応する値によって指定された回数複製されます。

source: (Use .kv or .pairs to suppress this behavior in list context.)
ja: (リストコンテキストでこの振る舞いを抑制するには.kv か.pairsを使って下さい。)

source: As with Hash types, Pair and Mapping are mutable in their values but not in their keys.
ja: Hash型のようにPairとMappingはそれらの値を変更できますがキーはできません。

source: (A key can be a reference to a mutable object, but cannot change its .WHICH identity.
ja: (キーは変更可能なオブジェクトへの参照になれますが、.WHICHの固有性は変化しません。

source: In contrast, the value may be rebound to a different object, just as a hash element may.)
ja: 対照的に、ハッシュの要素と同様に値は異なるオブジェクトに再バインドされるでしょう。)

source: Explicit types are optional.
ja: 明示的な型はオプショナルです。

source: Perl variables have two associated types: their "value type" and their "implementation type".
ja: Perlの変数は2つの関連する型を持ちます: それらの"値型"と"実装型"です。

source: (More generally, any container has an implementation type, including subroutines and modules.) The value type is stored as its of property, while the implementation type of the container is just the object type of the container itself.
ja: (より一般的には、どの種類のコンテナもサブルーチンとモジュールを含む実装型を持ちます。)値型はそのofプロパティとして格納され、コンテナの実装型は単にコンテナ自身のオブジェクト型です。

source: The word returns is allowed as an alias for of.
ja: 単語returnsはofの別名として許可されます。

source: The value type specifies what kinds of values may be stored in the variable.
ja: 値型はどの種類の値が変数に格納されるか指定します。

source: A value type is given as a prefix or with the of keyword:
ja: 値型は前置かofキーワードで与えられます:

source: In either case this sets the of property of the container to Dog.
ja: どちらの場合でもコンテナのofプロパティをDogに設定します。

source: Subroutines have a variant of the of property, as, that sets the as property instead.
ja: サブルーチンはofプロパティの変化形asを持ち、代わりにasプロパティを設定します。

source: The as property specifies a constraint (or perhaps coercion) to be enforced on the return value (either by explicit call to return or by implicit fall-off-the-end return).
ja: asプロパティは返値に強制される制約(もしかしたら抑制) を指定します(returnによって明示的に呼ばれるか最後の暗黙の返値のいずれかによって)。

source: This constraint, unlike the of property, is not advertised as the type of the routine.
ja: ofプロパティのようでないこの制約はルーチンの型としては表に出ません。

source: You can think of it as the implicit type signature of the (possibly implicit) return statement.
ja: それは(もしかしたら暗黙の)return文の暗黙の型シグネチャと考えることができます。

source: It's therefore available for type inferencing within the routine but not outside it.
ja: 従ってルーチン内で型推論が利用できますが外側ではできません。

source: If no as type is declared, it is assumed to be the same as the of type, if declared.
ja: as型が宣言されていない場合、of型が宣言されている場合と同じと見なされます。

source: A value type on an array or hash specifies the type stored by each element:
ja: 配列かハッシュでの値型はそれぞれの格納された要素の型を指定します:

source: The key type of a hash may be specified as a shape trait--see S09.
ja: ハッシュのキーの型はshape traitで指定されます―S09を参照して下さい。

source: The implementation type specifies how the variable itself is implemented.
ja: 実装型は変数自身がどの様に実装されているかを指定します。

source: It is given as a trait of the variable:
ja: これは変数のtraitとして与えられます:

source: Defining an implementation type is the Perl 6 equivalent to tying a variable in Perl 5.
ja: 実装型を定義することはPerl 6ではPerl 5の変数のtieに相当します。

source: But Perl 6 variables are tied directly at declaration time, and for performance reasons may not be tied with a run-time tie statement unless the variable is explicitly declared with an implementation type that does the Tieable role.
ja: しかしPerl 6の変数は宣言時に直接tieされ、Tieable roleを行う実装型で明示的に宣言された変数でなければパフォーマンス上の理由で実行時にtie文でtieされません。

source: However, package variables are always considered Tieable by default.
ja: しかしながらパッケージ変数は常にデフォルトでTieableとみなされます。

source: As a consequence, all named packages are also Tieable by default.
ja: その結果、全ての名前付きパッケージもデフォルトでTieableです。

source: Classes and modules may be viewed as differently tied packages.
ja: クラスとモジュールはtieされたパッケージとは異なると見られます。

source: Looking at it from the other direction, classes and modules that wish to be bound to a global package name must be able to do the Package role.
ja: 他の方向から見れば、グローバルパッケージにバインドされることを希望するクラスとモジュールはPackage roleが可能である必要があります。

source: A non-scalar type may be qualified, in order to specify what type of value each of its elements stores:
ja: どの型の値がそれぞれの要素に格納されているか指定するため、非スカラー型は修飾されるでしょう:

source: Each successive of makes the type on its right a parameter of the type on its left.
ja: それぞれの連続するofはその右のパラメータの型を、その左の型にさせます。

source: Parametric types are named using square brackets, so:
ja: パラメータ付きの型は角括弧を使って名前を付けられます。だから:

source: actually means:
ja: は実際には以下のような意味になります:

source: Because the actual variable can be hard to find when complex types are specified, there is a postfix form as well:
ja: 複雑な型が指定された場合は実際の変数を理解するのが大変なので、同様の後置形式があります:

source: The as form may be used in subroutines:
ja: サブルーチンではas形式が使われるでしょう:

source: Alternately, the return type may be specified within the signature:
ja: 代わりに返値の型はシグネチャ内で指定されるでしょう:

source: There is a slight difference, insofar as the type inferencer will ignore a as but pay attention to --> or prefix type declarations, also known as the of type.
ja: 型の推測者がasを無視する限りにおいて、そこには微妙な違いがあります。しかしof型としても知られる-->または後置の型宣言に注意を払って下さい。

source: Only the inside of the subroutine pays attention to as, and essentially coerces the return value to the indicated type, just as if you'd coerced each return expression.
ja: サブルーチンの内側だけがasに注意を払っており、本質的に返値はそれぞれのreturn式を強制したかのように指定された型に強制されます。

source: You may also specify the of type as the of trait (with returns allowed as a synonym):
ja: of型をof trait(returnsが同義語として許可される)として指定することもできます:

source: Anywhere you can use a single type you can use a set of types, for convenience specifiable as if it were an "or" junction:
ja: "or"かjunctionであるかのように、単一の型をセットで使うことが出来ます:

source: Fancier type constraints may be expressed through a subtype:
ja: 手の込んだ型制約はsubtypeを通して表現されるでしょう:

source: Since the terms in a parameter could be viewed as a set of constraints that are implicitly "anded" together (the variable itself supplies type constraints, and where clauses or tree matching just add more constraints), we relax this to allow juxtaposition of types to act like an "and" junction:
ja: パラメータの項は暗黙に一緒に"anded"された制約のセットと見ることができるので(変数自身は型制約を供給し、where条項かツリーマッチングはさらに制約を加えるだけです)、我々は"and" junctionのように型の並びを許可するためにこれを緩和します:

source: Parameters may be given types, just like any other variable:
ja: パラメータは他のどの様な変数と同じように型を与えられるでしょう:

source: Within a declaration, a class variable (either by itself or following an existing type name) declares a new type name and takes its parametric value from the actual type of the parameter it is associated with.
ja: 宣言の中で、クラス変数(それ自身か既存の型名の後のどちらか)は新しい型名を宣言し、実際のパラメータの型と関連づけられているパラメータ付きの値を受け取ります。

source: It declares the new type name in the same scope as the associated declaration.
ja: これは関連付けられた宣言として同じスコープ内で新しい型名を宣言します。

source: The new type name is introduced immediately, so two such types in the same signature must unify compatibly if they have the same name:
ja: 新しい型名は直ちに取り込まれ、同じシグネチャ内の2つのそのような型は同じ名前の場合は互換性を統一する必要があります:

source: On a scoped subroutine, a return type can be specified before or after the name.
ja: スコープ付きサブルーチンでは、返値の型は名前の前か後で指定できます。

source: We call all return types "return types", but distinguish two kinds of return types, the as type and the of type, because the of type is normally an "official" named type and declares the official interface to the routine, while the as type is merely a constraint on what may be returned by the routine from the routine's point of view.
ja: 我々は返値の型を"return types"と呼びますが、as型とof型の2種類の返値の型は区別します。なぜならof型は通常は"official"な名前を付けられた型名で、ルーチンに対するオフィシャルなインターフェースを宣言します。asは単にルーチン視点でルーチンによって何が返されるかの制約です。

source: If a subroutine is not explicitly scoped, it belongs to the current namespace (module, class, grammar, or package), as if it's scoped with the our scope modifier.
ja: もしサブルーチンが明示的にスコープ化されていないなら、それはourスコープ修飾子でスコープ化されるかのように現在の名前空間(モジュール、クラス、grammarまたはパッケージ)に属します。

source: Any return type must go after the name:
ja: 返値の型はどれでも名前の後に移動する必要があります:

source: On an anonymous subroutine, any return type can only go after the sub keyword:
ja: 無名サブルーチンでは、どの返値の型もsubキーワードの後にしか移動できません:

source: but you can use a scope modifier to introduce an of prefix type:
ja: of後置型を導入するためにスコープ修飾子を使うことが出来ます:

source: Because they are anonymous, you can change the my modifier to our without affecting the meaning.
ja: それらは無名なので、my修飾子は意味に影響を与えずに ourに変更できます。

source: The return type may also be specified after a --> token within the signature.
ja: 返値の型はシグネチャの中で-->トークンの後で指定することもできます。

source: This doesn't mean exactly the same thing as as.
ja: これはasと正確に同じ意味があるものではありません。

source: The of type is the "official" return type, and may therefore be used to do type inferencing outside the sub.
ja: of型は"official"な返値の型で、サブルーチンの外側で型推論を行うために使用されます。

source: The as type only makes the return type available to the internals of the sub so that the return statement can know its context, but outside the sub we don't know anything about the return value, as if no return type had been declared.
ja: as型はサブルーチンの内部で利用できる返値の型を作るだけで、return文がそのコンテキストを知ることができますが、サブルーチンの外側では返値の型が宣言されていないかのように返値の型に関して何も知ることができません。

source: The prefix form specifies the of type rather than the as type, so the return type of
ja: 後置形式はas型よりもof型を指定するので、返値の型の

source: is known to return an object of type Fish, as if you'd said:
ja: はあなたが次のようにしたかのようにFish型のオブジェクトを返すと知ることができます:

source: not as if you'd said
ja: 次のようにではなく

source: It is possible for the of type to disagree with the as type:
ja: of型とas型を区別することが可能です:

source: or equivalently,
ja: または同じに

source: Perl 6 includes a system of sigils to mark the fundamental structural type of a variable:
ja: Perl 6は変数の基本的な構造をマークするためのsigilsシステムを含みます。

source: Within a declaration, the & sigil also declares the visibility of the subroutine name without the sigil within the scope of the declaration:
ja: 宣言内で& sigilはスコープ宣言内のsigil無しにサブルーチン名の可視性も宣言します:
